;; -*- after-save-hook: org-babel-tangle; -*-
******* Doom init
#+BEGIN_SRC emacs-lisp :tangle "~/Github/doom-emacs/init.el" :mkdirp yes
;;; init.el -*- lexical-binding: t; -*-
;;
;; Author:  Henrik Lissner <henrik@lissner.net>
;; URL:     https://github.com/hlissner/.emacs.d
;;
;;   =================     ===============     ===============   ========  ========
;;   \\ . . . . . . .\\   //. . . . . . .\\   //. . . . . . .\\  \\. . .\\// . . //
;;   ||. . ._____. . .|| ||. . ._____. . .|| ||. . ._____. . .|| || . . .\/ . . .||
;;   || . .||   ||. . || || . .||   ||. . || || . .||   ||. . || ||. . . . . . . ||
;;   ||. . ||   || . .|| ||. . ||   || . .|| ||. . ||   || . .|| || . | . . . . .||
;;   || . .||   ||. _-|| ||-_ .||   ||. . || || . .||   ||. _-|| ||-_.|\ . . . . ||
;;   ||. . ||   ||-'  || ||  `-||   || . .|| ||. . ||   ||-'  || ||  `|\_ . .|. .||
;;   || . _||   ||    || ||    ||   ||_ . || || . _||   ||    || ||   |\ `-_/| . ||
;;   ||_-' ||  .|/    || ||    \|.  || `-_|| ||_-' ||  .|/    || ||   | \  / |-_.||
;;   ||    ||_-'      || ||      `-_||    || ||    ||_-'      || ||   | \  / |  `||
;;   ||    `'         || ||         `'    || ||    `'         || ||   | \  / |   ||
;;   ||            .===' `===.         .==='.`===.         .===' /==. |  \/  |   ||
;;   ||         .=='   \_|-_ `===. .==='   _|_   `===. .===' _-|/   `==  \/  |   ||
;;   ||      .=='    _-'    `-_  `='    _-'   `-_    `='  _-'   `-_  /|  \/  |   ||
;;   ||   .=='    _-'          '-__\._-'         '-_./__-'         `' |. /|  |   ||
;;   ||.=='    _-'                                                     `' |  /==.||
;;   =='    _-'                                                            \/   `==
;;   \   _-'                                                                `-_   /
;;    `''                                                                      ``'
;;
;; These demons are not part of GNU Emacs.
;;
;;; License: MIT

(require 'core (concat user-emacs-directory "core/core"))

(setq user-login-name "allforabit")

(doom! :feature
       evil            ; come to the dark side, we have cookies
       jump            ; helping you get around
       snippets        ; my elves. They type so I don't have to
       file-templates  ; auto-snippets for empty files
       hydra           ; keybindings that stick around
       spellcheck      ; tasing you for misspelling mispelling
       syntax-checker  ; tasing you for every semicolon you forget
       version-control ; remember, remember that commit in November
       workspaces      ; tab emulation, persistence & separate workspaces
       eval            ; repls, runners 'n builders; run code, run
      ;debug           ; FIXME stepping through code, to help you add bugs

       :completion
       company         ; the ultimate code completion backend
       ;ivy             ; a search engine for love and life
      helm            ; the *other* search engine for love and life
      ;ido             ; the other *other* search engine...

       :ui
       doom            ; what makes DOOM look the way it does
       doom-dashboard  ; a nifty splash screen for Emacs
       doom-modeline   ; a snazzy Atom-inspired mode-line
       doom-quit       ; DOOM quit-message prompts when you quit Emacs
       hl-todo         ; highlight TODO/FIXME/NOTE tags
       nav-flash       ; blink the current line after jumping
       evil-goggles    ; display visual hints when editing in evil
      ;unicode         ; extended unicode support for various languages
      ;tabbar          ; FIXME an (incomplete) tab bar for Emacs

       :tools
       dired           ; making dired pretty [functional]
       electric-indent ; smarter, keyword-based electric-indent
       eshell          ; a consistent, cross-platform shell (WIP)
       gist            ; interacting with github gists
       impatient-mode  ; show off code over HTTP
      ;macos           ; MacOS-specific commands
       neotree         ; a project drawer, like NERDTree for vim
       password-store  ; password manager for nerds
       prodigy         ; manage external services from within emacs
       rotate-text     ; cycle region at point between text candidates
       term            ; terminals in Emacs
       tmux            ; an API for interacting with tmux
       upload          ; map local to remote projects via ssh/ftp

       :lang
      ;assembly        ; assembly for fun or debugging
      ;cc              ; C/C++/Obj-C madness
      ;crystal         ; ruby at the speed of c
      ;csharp          ; unity, .NET, and mono shenanigans
      ;data            ; config/data formats
      ;elixir          ; erlang done right
      ;elm             ; care for a cup of TEA?
       emacs-lisp      ; drown in parentheses
      ;go              ; the hipster dialect
      ;haskell         ; a language that's lazier than I am
      ;hy              ; readability of scheme w/ speed of python
      ;java            ; the poster child for carpal tunnel syndrome
      ;javascript      ; all(hope(abandon(ye(who(enter(here))))))
      ;julia           ; a better, faster MATLAB
      ;latex           ; writing papers in Emacs has never been so fun
      ;ledger          ; an accounting system in Emacs
      ;lua             ; one-based indices? one-based indices
      ;markdown        ; writing docs for people to ignore
      ;ocaml           ; an objective camel
      ;perl            ; write code no one else can comprehend
      php             ; make php less awful to work with
      ;plantuml        ; diagrams for confusing people more
      ;purescript      ; javascript, but functional
      ;python          ; beautiful is better than ugly
      ;rest            ; Emacs as a REST client
      ;ruby            ; 1.step do {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
      ;rust            ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
      ;scala           ; java, but good
      ;sh              ; she sells (ba|z)sh shells on the C xor
      ;swift           ; who asked for emoji variables?
      ;typescript      ; javascript, but better
      ;web             ; the tubes

       :org
       org             ; organize your plain life in plain text
       org-babel       ; executable code snippets in org-mode
       org-attach      ; a simpler attachment system
       org-capture     ; a better org-capture, in or outside of Emacs
       org-export      ; a custom, centralized export system
       org-notebook    ; org-mode as a notebook
       org-present     ; using org-mode for presentations
      ;org-sync        ; TODO sync with mobile
      ;org-publish     ; TODO org + blogs

       ;; Applications are complex and opinionated modules that transform Emacs
       ;; toward a specific purpose. They may have additional dependencies and
       ;; should be loaded last.
       :app
       email           ; emacs as an email client
       irc             ; how neckbeards socialize
       rss             ; emacs as an RSS reader
       twitter         ; twitter client https://twitter.com/vnought
       write           ; emacs as a word processor (latex + org + markdown)

       ;; Private modules named after your username are loaded automatically.
       ;; Leaving this here is harmless though. Also, they are omitted from
       ;; source control (except for mine; use it as a reference).
       ;; original value: hlissner
       :private allforabit)

        #+END_SRC

        #+RESULTS:
        : Doom modules initialized
******* Packages

        #+BEGIN_SRC emacs-lisp :tangle  "~/Github/doom-emacs/modules/private/allforabit/packages.el" :mkdirp yes
(package! drupal-mode)
        #+END_SRC

        #+RESULTS:
        | drupal-mode |
******* TODO Bindings
:PROPERTIES:
:END:

#+BEGIN_SRC emacs-lisp
(org-map-entries
      '(org-entry-get nil "ITEM"))
#+END_SRC

#+RESULTS:
| Bindings | Global | Leader | TAB |






** A test sh file
#+BEGIN_SRC sh
cd ~/dotfiles/
ls -la
#+END_SRC

#+RESULTS:
| total       | 136 |       |       |       |     |    |       |                                  |    |                                |
| drwxr-xr-x  |  19 | kevin | staff |   646 | Oct |  1 | 14:24 | 0                                |    |                                |
| lrwxr-xr-x  |   1 | kevin | staff |    30 | Oct |  1 | 14:24 | .#README.org                     | -> | kevin@MacBook-Air-4.local.2271 |
| drwxr-xr-x@ | 260 | kevin | staff |  8840 | Oct |  1 | 13:52 | ..                               |    |                                |
| -rw-r--r--@ |   1 | kevin | staff | 12292 | Aug |  4 | 10:51 | .DS_Store                        |    |                                |
| drwxr-xr-x  |  17 | kevin | staff |   578 | Oct |  1 | 14:24 | .git                             |    |                                |
| -rw-r--r--  |   1 | kevin | staff |    71 | Sep | 16 | 14:01 | .gitignore                       |    |                                |
| -rw-r--r--  |   1 | kevin | staff |   158 | Mar |  8 |  2017 | .gitmodules                      |    |                                |
| -rw-r--r--  |   1 | kevin | staff |  3233 | Oct |  1 | 14:24 | README.org                       |    |                                |
| drwxr-xr-x  |   5 | kevin | staff |   170 | Jul | 15 | 18:32 | autoit                           |    |                                |
| -rw-r--r--  |   1 | kevin | staff |  2968 | Mar |  8 |  2017 | bashrc                           |    |                                |
| drwxr-xr-x  |   4 | kevin | staff |   136 | Jun | 29 |  2014 | gt8_patches                      |    |                                |
| -rw-r--r--@ |   1 | kevin | staff |   341 | Feb | 26 |  2017 | instruments.xml                  |    |                                |
| -rw-r--r--  |   1 | kevin | staff |   587 | Jul | 15 | 18:32 | jsbeautifyrc                     |    |                                |
| -rwxr-xr-x  |   1 | kevin | staff |  1129 | Mar |  8 |  2017 | makesymlinks.sh                  |    |                                |
| -rw-r--r--  |   1 | kevin | staff |  1821 | Jun | 10 |  2016 | midi_program_change_to_note.mipi |    |                                |
| drwxr-xr-x  |   9 | kevin | staff |   306 | Sep | 16 | 14:39 | spacemacs.d                      |    |                                |
| drwxr-xr-x  |   9 | kevin | staff |   306 | Mar |  8 |  2017 | vim                              |    |                                |
| -rw-r--r--  |   1 | kevin | staff | 10793 | Jun | 10 |  2016 | vimrc                            |    |                                |
| -rw-r--r--  |   1 | kevin | staff |  1024 | Sep | 23 | 15:37 | zshrc                            |    |                                |
